<a href="https://colab.research.google.com/github/wchaconr/Mintic/blob/main/DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Laboratorio 7.1
Elaborado por Oscar Franco-Bedoya

Proyecto Mision TIC 2022

# Objetivo
En este laboratorio realizaremos los ejercicios sobre dataframes vistos en el video.

 # Creación de dataframes
La forma más sencilla de crear un dataframe es desde un diccionario.

In [ ]:
import pandas as pd

datos = {
  "alimentos": ["Manzana", "Piña", "Pera","Arándano","Fresa"],
  "calorias": [52, 55, 55,35,32]
}

# Se "cargan" en un Dataframe
df = pd.DataFrame(datos)

print(df)

  alimentos  calorias
0   Manzana        52
1      Piña        55
2      Pera        55
3  Arándano        35
4     Fresa        32

In [ ]:
# Lista de columnas del dataframe
df.columns

Index(['alimentos', 'calorias'], dtype='object')

In [ ]:
# obtener los dos primeros elementos del dataframe
print(df.head(2))

  alimentos  calorias
0   Manzana        52
1      Piña        55

In [ ]:
# obtener los dos últimos elementos del dataframe
df.tail(2)

  alimentos  calorias
3  Arándano        35
4     Fresa        32

In [ ]:
# I nformación técnica del dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   alimentos  5 non-null      object
 1   calorias   5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [ ]:
# calculo de estadísticas
df.describe()

        calorias
count   5.000000
mean   45.800000
std    11.344602
min    32.000000
25%    35.000000
50%    52.000000
75%    55.000000
max    55.000000

In [ ]:
# Obtiene la lista de valores de una columna 
df["alimentos"]

0     Manzana
1        Piña
2        Pera
3    Arándano
4       Fresa
Name: alimentos, dtype: object

In [ ]:
# convierte los valores de la columna a una lista
list(df["alimentos"])

['Manzana', 'Piña', 'Pera', 'Arándano', 'Fresa']

In [ ]:
# valor maximo en el dataframe
df.max()

alimentos    Piña
calorias       55
dtype: object

In [ ]:
# elemento en la posición 0 del dataframe
df.loc[0]

alimentos    Manzana
calorias          52
Name: 0, dtype: object

# otro ejemplo
En este ejemplo tenemos un dataframe con 4 columnas.

In [ ]:
datos_productos={
    'category': ['Cleaning', 'Cleaning', 'Entertainment', 'Entertainment', 'Tech', 'Tech'],
    'store': ['Walmart', 'Dia', 'Walmart', 'Fnac', 'Dia','Walmart'],
    'price':[11.42, 23.50, 19.99, 15.95, 55.75, 111.55],
    'testscore': [4, 3, 5, 7, 5, 8]}

dfP = pd.DataFrame(datos_productos)
dfP

        category    store   price  testscore
0       Cleaning  Walmart   11.42          4
1       Cleaning      Dia   23.50          3
2  Entertainment  Walmart   19.99          5
3  Entertainment     Fnac   15.95          7
4           Tech      Dia   55.75          5
5           Tech  Walmart  111.55          8

In [ ]:
# Ordena los valores del dataframe por una columna  
dfP.sort_values("price")

        category    store   price  testscore
0       Cleaning  Walmart   11.42          4
3  Entertainment     Fnac   15.95          7
2  Entertainment  Walmart   19.99          5
1       Cleaning      Dia   23.50          3
4           Tech      Dia   55.75          5
5           Tech  Walmart  111.55          8

In [ ]:
# Muestra el uso de slicing en dataframes 
dfP.iloc[1:4]

        category    store  price  testscore
1       Cleaning      Dia  23.50          3
2  Entertainment  Walmart  19.99          5
3  Entertainment     Fnac  15.95          7

# Seleccionando elementos del dataframe con expresiones lógicas

In [ ]:

dfP["category"]=="Entertainment"

0    False
1    False
2     True
3     True
4    False
5    False
Name: category, dtype: bool

In [ ]:
dfP[dfP["category"]=="Entertainment"]

        category    store  price  testscore
2  Entertainment  Walmart  19.99          5
3  Entertainment     Fnac  15.95          7

In [ ]:
dfP[dfP["price"]>=20]

   category    store   price  testscore
1  Cleaning      Dia   23.50          3
4      Tech      Dia   55.75          5
5      Tech  Walmart  111.55          8

---
FIN DEL LABORATORIO
---